package com.kjgs.conversation2.func2;

import com.kjgs.conversation.mysql.Impl逻辑;
import com.kjgs.conversation2.FuncAbstract;
import com.kjgs.conversation2.Tool;
import com.kjgs.枚举.Cons;
import org.bson.Document;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Service;

import javax.annotation.PostConstruct;

@Service
public class 后 extends FuncAbstract {
    @Autowired
    Impl逻辑 impl逻辑;
    @PostConstruct
    public void init(){
        // 初始化加载逻辑的目的是：要在形成逻辑的时候分割出其中的动态变量，所以加载初始化逻辑很有必要。。
        //加载初始化逻辑语句
        impl逻辑.保存逻辑("《如果》《遇到》《0》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《1》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《2》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《3》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《4》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《5》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《6》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《7》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《8》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《9》《，》《那就》《标记》《当前词》《的》《词性》《为》《数字》");
        impl逻辑.保存逻辑("《如果》《遇到》《后》《，》《并且》《后面1个字》《是》《面》《，》《那就》《把》《当前词》《和》《后面1个字》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《后》《，》《并且》《后面2个字》《是》《面第》《，》《那就》《把》《当前词》《和》《后面2个字》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《后》《，》《并且》《后面4个字》《是》《面的内容》《，》《那就》《把》《当前词》《和》《后面4个字》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《后》《，》《并且》《后面4个字》《是》《面所有字》《，》《那就》《把》《当前词》《和》《后面4个字》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《后面》《，》《并且》《后面1个成分》《的》《词性》《是》《数字》《，》" +
                "《并且》《再后面1个成分》《是》《个字》《，》《那就》《把》《当前词》《和》《后面2个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《后面》《，》《并且》《后面1个成分》《是》《个字》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《后面》《，》《并且》《后面1个成分》《是》《个成分》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《后面》《，》《并且》《后面1个成分》《是》《个分隔符》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《后面第》《，》《并且》《后面1个成分》《是》《个名词》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");

        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《前面》《，》《并且》《后面1个成分》《是》《个字》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《前面》《，》《并且》《后面1个成分》《是》《个成分》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《前面》《，》《并且》《后面1个成分》《是》《个分隔符》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");
        impl逻辑.保存逻辑("《如果》《遇到》《数字》《，》《并且》《前面1个成分》《是》《前面第》《，》《并且》《后面1个成分》《是》《个名词》《，》《那就》《把》《前面1个成分》《和》《当前词》《，》《再和》《后面1个成分》《合并为》《1》《个词》");

    }

    public void 功能() {
        分词_后面的内容();
        分词_后面();
    }
    public void 分词_后面的内容(){
        Document 指定下标的逻辑成分 = Tool.指定下标的逻辑成分(结束下标);
        if (指定下标的逻辑成分 == null) {
            return;
        }
        int 结束下标 =  下标+5;
        if(结束下标 > 逻辑句子.length()){
            return;
        }
        String 记录成处理逻辑 = 逻辑句子.substring(下标, 结束下标);
        if (!"后面的内容".equals(记录成处理逻辑)) {
            return;
        }
        //满足条件 合并果，创建新成分，删除旧成分
        逻辑成分.put(Cons.词语, 记录成处理逻辑);
        逻辑成分.put(Cons.词性, Cons.名词);
        逻辑成分.put(Cons.结束下标, 结束下标);
        Tool.删除指定范围下标的逻辑成分(下标+1, 结束下标);
    }
    public void 分词_后面(){
        Document 指定下标的逻辑成分 = Tool.指定下标的逻辑成分(结束下标);
        if (指定下标的逻辑成分 == null) {
            return;
        }
        int 结束下标 =  下标+2;
        if(结束下标 > 逻辑句子.length()){
            return;
        }
        String 记录成处理逻辑 = 逻辑句子.substring(下标, 结束下标);
        if (!"后面".equals(记录成处理逻辑)) {
            return;
        }
        //满足条件 合并果，创建新成分，删除旧成分
        逻辑成分.put(Cons.词语, 记录成处理逻辑);
        逻辑成分.put(Cons.词性, Cons.名词);
        逻辑成分.put(Cons.结束下标, 结束下标);
        Tool.删除指定范围下标的逻辑成分(下标+1, 结束下标);
    }
}
